benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/stable-logs/jaeger-benchmark-1000.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  5 threads and 300 connections
  Thread calibration: mean lat.: 1.666ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.790ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.724ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.838ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.595ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.11ms    4.28ms  21.02ms   96.02%
    Req/Sec   209.53    153.85   666.00     70.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.60ms
 90.000%    2.74ms
 99.000%   21.02ms
 99.900%   55.78ms
 99.990%   89.21ms
 99.999%  108.10ms
100.000%  108.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.866     0.000000            1         1.00
       0.976     0.100000         5037         1.11
       1.022     0.200000         9998         1.25
       1.071     0.300000        14947         1.43
       1.130     0.400000        19915         1.67
       1.202     0.500000        24906         2.00
       1.250     0.550000        27412         2.22
       1.310     0.600000        29891         2.50
       1.382     0.650000        32353         2.86
       1.479     0.700000        34860         3.33
       1.598     0.750000        37338         4.00
       1.681     0.775000        38572         4.44
       1.779     0.800000        39822         5.00
       1.905     0.825000        41060         5.71
       2.083     0.850000        42311         6.67
       2.339     0.875000        43548         8.00
       2.517     0.887500        44165         8.89
       2.745     0.900000        44789        10.00
       3.045     0.912500        45408        11.43
       3.487     0.925000        46037        13.33
       4.127     0.937500        46652        16.00
       4.555     0.943750        46963        17.78
       5.115     0.950000        47276        20.00
       5.819     0.956250        47585        22.86
       6.715     0.962500        47896        26.67
       8.279     0.968750        48208        32.00
       9.319     0.971875        48363        35.56
      10.495     0.975000        48519        40.00
      12.023     0.978125        48674        45.71
      13.599     0.981250        48829        53.33
      15.535     0.984375        48985        64.00
      16.751     0.985938        49063        71.11
      18.095     0.987500        49141        80.00
      19.791     0.989062        49218        91.43
      21.871     0.990625        49296       106.67
      24.127     0.992188        49374       128.00
      25.775     0.992969        49413       142.22
      27.583     0.993750        49451       160.00
      30.159     0.994531        49490       182.86
      32.671     0.995313        49529       213.33
      36.319     0.996094        49568       256.00
      38.079     0.996484        49588       284.44
      40.447     0.996875        49607       320.00
      42.079     0.997266        49626       365.71
      45.215     0.997656        49646       426.67
      48.319     0.998047        49665       512.00
      49.695     0.998242        49675       568.89
      50.655     0.998437        49685       640.00
      51.871     0.998633        49694       731.43
      53.599     0.998828        49704       853.33
      56.575     0.999023        49714      1024.00
      58.431     0.999121        49719      1137.78
      60.127     0.999219        49724      1280.00
      62.495     0.999316        49728      1462.86
      65.119     0.999414        49733      1706.67
      69.119     0.999512        49738      2048.00
      71.615     0.999561        49741      2275.56
      72.895     0.999609        49743      2560.00
      76.095     0.999658        49745      2925.71
      79.359     0.999707        49748      3413.33
      81.599     0.999756        49751      4096.00
      83.199     0.999780        49752      4551.11
      84.031     0.999805        49753      5120.00
      84.159     0.999829        49754      5851.43
      84.223     0.999854        49755      6826.67
      86.911     0.999878        49756      8192.00
      89.215     0.999890        49757      9102.22
      90.111     0.999902        49758     10240.00
      90.111     0.999915        49758     11702.86
      91.135     0.999927        49759     13653.33
      91.135     0.999939        49759     16384.00
      94.591     0.999945        49760     18204.44
      94.591     0.999951        49760     20480.00
      94.591     0.999957        49760     23405.71
      95.679     0.999963        49761     27306.67
      95.679     0.999969        49761     32768.00
      95.679     0.999973        49761     36408.89
      95.679     0.999976        49761     40960.00
      95.679     0.999979        49761     46811.43
     108.095     0.999982        49762     54613.33
     108.095     1.000000        49762          inf
#[Mean    =        2.110, StdDeviation   =        4.276]
#[Max     =      108.032, Total count    =        49762]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58979 requests in 1.00m, 11.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 17
Requests/sec:    983.02
Transfer/sec:    191.04KB