benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/stable-logs/jaeger-benchmark-40.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.468ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.631ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.57ms    1.01ms   5.71ms   97.64%
    Req/Sec    21.11     47.41   200.00     81.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42ms
 75.000%    1.63ms
 90.000%    1.80ms
 99.000%    5.71ms
 99.900%   14.11ms
 99.990%   17.18ms
 99.999%   17.18ms
100.000%   17.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.016     0.000000            1         1.00
       1.176     0.100000          201         1.11
       1.242     0.200000          399         1.25
       1.304     0.300000          598         1.43
       1.358     0.400000          800         1.67
       1.425     0.500000          997         2.00
       1.460     0.550000         1096         2.22
       1.501     0.600000         1199         2.50
       1.545     0.650000         1299         2.86
       1.582     0.700000         1396         3.33
       1.634     0.750000         1497         4.00
       1.654     0.775000         1547         4.44
       1.680     0.800000         1595         5.00
       1.713     0.825000         1647         5.71
       1.743     0.850000         1695         6.67
       1.777     0.875000         1745         8.00
       1.792     0.887500         1770         8.89
       1.805     0.900000         1793        10.00
       1.834     0.912500         1818        11.43
       1.870     0.925000         1843        13.33
       1.935     0.937500         1868        16.00
       1.954     0.943750         1880        17.78
       2.007     0.950000         1893        20.00
       2.044     0.956250         1905        22.86
       2.097     0.962500         1918        26.67
       2.299     0.968750         1930        32.00
       2.361     0.971875         1936        35.56
       2.509     0.975000         1943        40.00
       2.727     0.978125         1949        45.71
       2.907     0.981250         1955        53.33
       3.283     0.984375         1961        64.00
       3.629     0.985938         1964        71.11
       3.975     0.987500         1968        80.00
       5.467     0.989062         1971        91.43
       6.031     0.990625         1974       106.67
       6.623     0.992188         1977       128.00
       7.779     0.992969         1978       142.22
       8.751     0.993750         1980       160.00
      10.135     0.994531         1982       182.86
      10.575     0.995313         1983       213.33
      10.983     0.996094         1985       256.00
      10.983     0.996484         1985       284.44
      11.031     0.996875         1986       320.00
      12.463     0.997266         1987       365.71
      12.847     0.997656         1988       426.67
      12.959     0.998047         1989       512.00
      12.959     0.998242         1989       568.89
      12.959     0.998437         1989       640.00
      14.111     0.998633         1990       731.43
      14.111     0.998828         1990       853.33
      17.183     0.999023         1992      1024.00
      17.183     1.000000         1992          inf
#[Mean    =        1.574, StdDeviation   =        1.005]
#[Max     =       17.168, Total count    =         1992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2411 requests in 1.00m, 468.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 167
Requests/sec:     40.17
Transfer/sec:      7.81KB