benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/stable-logs/jaeger-benchmark-60.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.362ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.264ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.31ms  834.73us   4.52ms   97.49%
    Req/Sec    30.78     57.31   222.00     74.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.33ms
 90.000%    1.54ms
 99.000%    4.52ms
 99.900%   14.09ms
 99.990%   17.22ms
 99.999%   17.22ms
100.000%   17.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.885     0.000000            1         1.00
       1.002     0.100000          295         1.11
       1.045     0.200000          591         1.25
       1.085     0.300000          886         1.43
       1.126     0.400000         1180         1.67
       1.165     0.500000         1477         2.00
       1.192     0.550000         1623         2.22
       1.222     0.600000         1769         2.50
       1.253     0.650000         1923         2.86
       1.288     0.700000         2064         3.33
       1.334     0.750000         2213         4.00
       1.360     0.775000         2288         4.44
       1.395     0.800000         2361         5.00
       1.426     0.825000         2433         5.71
       1.464     0.850000         2505         6.67
       1.500     0.875000         2579         8.00
       1.525     0.887500         2616         8.89
       1.545     0.900000         2653        10.00
       1.575     0.912500         2691        11.43
       1.610     0.925000         2726        13.33
       1.646     0.937500         2763        16.00
       1.672     0.943750         2782        17.78
       1.690     0.950000         2800        20.00
       1.732     0.956250         2819        22.86
       1.820     0.962500         2837        26.67
       1.927     0.968750         2855        32.00
       2.016     0.971875         2865        35.56
       2.151     0.975000         2874        40.00
       2.383     0.978125         2883        45.71
       2.745     0.981250         2892        53.33
       3.105     0.984375         2901        64.00
       3.369     0.985938         2906        71.11
       3.691     0.987500         2911        80.00
       4.011     0.989062         2915        91.43
       4.987     0.990625         2920       106.67
       5.639     0.992188         2924       128.00
       5.987     0.992969         2927       142.22
       6.315     0.993750         2929       160.00
       6.447     0.994531         2931       182.86
       7.667     0.995313         2934       213.33
       8.087     0.996094         2936       256.00
       8.139     0.996484         2937       284.44
       8.567     0.996875         2939       320.00
       8.567     0.997266         2939       365.71
       8.815     0.997656         2941       426.67
      10.687     0.998047         2942       512.00
      10.687     0.998242         2942       568.89
      11.847     0.998437         2943       640.00
      11.847     0.998633         2943       731.43
      14.087     0.998828         2944       853.33
      15.791     0.999023         2945      1024.00
      15.791     0.999121         2945      1137.78
      15.791     0.999219         2945      1280.00
      15.791     0.999316         2945      1462.86
      16.767     0.999414         2946      1706.67
      16.767     0.999512         2946      2048.00
      16.767     0.999561         2946      2275.56
      16.767     0.999609         2946      2560.00
      16.767     0.999658         2946      2925.71
      17.215     0.999707         2947      3413.33
      17.215     1.000000         2947          inf
#[Mean    =        1.309, StdDeviation   =        0.835]
#[Max     =       17.200, Total count    =         2947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3593 requests in 1.00m, 698.25KB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:     59.86
Transfer/sec:     11.63KB